Repository: vdr-projects/vdr-plugin-epgfixer
Catalog: po/*.po
Languages: pl_pl

source: Fix bugs in EPG
pl_pl: Koryguj b��dy w EPG

source: RegexpChars$ abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789%~\/?!()[]{}<>$^*.,:;-=#
pl_pl: RegexpChars$ abcdefghijklmnopqrstuvwxyz�����󶼿ABCDEFGHIJKLMNOPQRSTUVWXYZ�����Ӧ��0123456789%~\/?!()[]{}<>$^*.,:;-=#

source: Button$Cancel
pl_pl: Anuluj

source: Regular expressions
pl_pl: Wyra�enia regularne

source: Edit regular expressions.
pl_pl: Edycja wyra�e� regularnych.

source: Character set conversions
pl_pl: Konwersje zestawu znak�w

source: Edit character set conversions.
pl_pl: Edycja konwersji zestawu znak�w.

source: EPG blacklists
pl_pl: Czarna lista EPG

source: Edit EPG blacklists.
pl_pl: Edycja czarnej listy EPG.

source: EPG cloning
pl_pl: Klonowanie danych EPG

source: Edit EPG data cloning.
pl_pl: Edycja klonowanych danych EPG.

source: Debug logging
pl_pl: Logowanie debugowania

source: Configure debug logging options.
pl_pl: Konfiguracja opcji logowania debugowania.

source: --- EPG bugfixes ---
pl_pl: --- Korekcja b��dnych EPG ---

source: Remove quotes from ShortText
pl_pl: Usu� cudzys��w z nag��wka

source: EPG bugfix level >= 1: Some channels put the ShortText in quotes and use either the ShortText or the Description field, depending on how long the string is: Title "ShortText". Description
pl_pl: Korekcja EPG poziom >= 1: Niekt�re kana�y maj� nag��wek w cudzys�owu i u�ywaj� pola nag��wka albo opisu, zale�nie od d�ugo�ci ci�gu znak�w: Tytu� "Nag��wek". Opis

source: Move Description from ShortText
pl_pl: Przenie� opis z nag��wka

source: EPG bugfix level >= 1: Some channels put the Description into the ShortText (preceded by a blank) if there is no actual ShortText and the Description is short enough: Title Description
pl_pl: Korekcja EPG poziom >= 1: Niekt�re kana�y umieszczaj� opis w nag��wku (poprzedzony luk�) je�eli nie ma atualnego nag��wka a opis jest wystarczaj�co kr�tki: Tytu� Opis

source: no
pl_pl: nie

source: conservative
pl_pl: ostro�ny

source: aggressive
pl_pl: agresywny

source: Remove repeated title from ShortText
pl_pl: Usu� powt�rzony tytu� w nag��wku

source: EPG bugfix level >= 1: Remove repeated Title from ShortText: no=disabled conservative=whitespace boundaries only aggressive=also accept : | / as separators
pl_pl: Korekcja EPG poziom >= 1: Usuwa powt�rzony tytu� z nag��wka: nie=wy��czone ostro�ny=tylko na granicach spacji agresywny=akceptuj tak�e : | / jako separatory

source: Remove double quotes from ShortText
pl_pl: Usu� podw�jny cudzys��w z nag��wka

source: EPG bugfix level >= 1: Some channels put the ShortText between double quotes, which is nothing but annoying (some even put a '.' after the closing '"'): Title "ShortText"[.]
pl_pl: Korekcja EPG poziom >= 1: Niekt�re kana�y umieszczaj� nag��wek w podw�jnym cudzys�owu (niekt�re maj� nawet '.' po zamykaj�cym '"'): Tytu� "Nag��wek"[.]

source: Remove useless formatting
pl_pl: Usu� niepotrzebne formatowanie

source: EPG bugfix level >= 2: Some channels apparently try to do some formatting in the texts, which is a bad idea because they have no way of knowing the width of the window that will actually display the text. Remove excess whitespace.
pl_pl: Korekcja EPG poziom >=2: Niekt�re kana�y pr�buj� formatowa� tekst, co jest z�ym pomys�em poniewa� nie wiedz� jaki jest rozmiar okna, w kt�rym b�dzie wy�wietlany tekst. Usuwa niepotrzebne luki/spacje.

source: Move long ShortText to Description
pl_pl: Przenie� d�ugi nag��wek do opisu

source: EPG bugfix level >= 2: Some channels put a whole lot of information in the ShortText and leave the Description totally empty. So if the ShortText length exceeds 40, let's put this into the Description instead.
pl_pl: Korekcja EPG poziom >=2: Niekt�re kana�y umieszczaj� du�e ilo�ci informacji w nag��wku a pole opisu pozostawiaj� puste. Wi�c je�eli nag��wek przekracza 40 znak�w, zostanie przeniesiony do opisu.

source: Prevent equal ShortText and Description
pl_pl: Zapobiegaj powielaniu w nag��wku i opisie

source: EPG bugfix level >= 2: Some channels put the same information into ShortText and Description. In that case we delete one of them.
pl_pl: Korekcja EPG poziom >=2: Niekt�re kana�y umieszczaj� to samo w nag��wku i opisie. Usuwa jedno z nich.

source: Replace backticks with single quotes
pl_pl: Zast�p odwr�cony cudzys��w pojedynczym cudzys�owem

source: EPG bugfix level >= 2: Some channels use the ` ("backtick") character, where a ' (single quote) would be normally used. Actually, "backticks" in normal text don't make much sense, so let's replace them.
pl_pl: Korekcja EPG poziom >=2: Niekt�re kana�y u�ywaj� znaku ` (odwr�cony cudzys��w), gdzie normalnie u�yty by�by ' (pojedynczy cudzys��w). Ta funkcja to wykonuje.

source: Fix stream component descriptions
pl_pl: Koryguj opis sk�adnik�w strumienia

source: EPG bugfix level = 3: The stream components have a "description" field which some channels apparently have no idea of how to set correctly.
pl_pl: Korekcja EPG poziom = 3: Sk�adniki strumienia posiadaj� pole opisu czego niekt�re kana�y nie potrafi� prawid�owo ustawi�.

source: Strip HTML entities
pl_pl: Usu� znaczniki HTML

source: Convert HTML entities from all fields to matching regular characters.
pl_pl: Konwertuje znaczniki HTML odpowiadaj�cym im znakom.

source: Button$Load
pl_pl: �aduj

source: Button$Clear EPG
pl_pl: Czy�� EPG

source: Loading configuration files...
pl_pl: �adowanie plik�w konfiguracyjnych...

source: Clearing EPG data...
pl_pl: Czyszczenie danych EPG...

source: Help
pl_pl: Pomoc

source: --- Debug Logging Options ---
pl_pl: --- Opcje logowania debugowania ---

source: EPG Handler
pl_pl: Obs�uga EPG

source: Channel Filtering
pl_pl: Filtrowanie kana��w

source: Regular Expressions
pl_pl: Wyra�enia regularne

source: Character Set Conversion
pl_pl: Konwersja zestawu znak�w

source: EPG Cloning
pl_pl: Klonowanie EPG

source: Blacklist
pl_pl: Czarna lista

source: HTML Stripping
pl_pl: Usuwanie HTML

source: Original EPG Bug Fixes
pl_pl: Oryginalne poprawki EPG
